%% matlab 运算符
% 算术运算符
% + ： 加法，如为矩阵大小必须一致
A = [1 2; 3 4]
B = ones(2)
A+B
C = ones(3) % 不一致大小矩阵
A+C

a = 1
b = 2
a + b
%%
% -: 减法操作与加法一致
A-B
%%
% *乘法：如为矩阵A\*B，**A的列数**目必须与**B行数**一致。满足$C(i,j)=A(i,k)*B(k,j)
% 乘法规律为$C(i,j)$的元素为A矩阵的第$i$行的每个元素与B矩阵的第*j*列每个元素乘积之和
% 举例来说：
% 
% A矩阵为2行3列矩阵：
% 
% A= [1,2,3;4,5,6] 
% 
% B矩阵为3列3行矩阵：
% 
% B = [1,2,3;4,5,6;7,8,9]
% 
% 那么C 为A*B的解，那么C的第一行一列元素计算方法如下：
% 
% A的第一行[1,2,3] B的第一列[1;4;7],他们每个元素相乘并累加
% 
% 1\*1+2\*4+3\*7 = 30, 
% 
% C的第二行一列元素为A的第二行[4,5,6]与B第一列[1;4;7]元素相乘并累加得到
% 
% 4\*1+5\*4+6\*7=66，
% 
% 依次类推，可以得到C最终等于
% 
% C = [30,36,42;66,81,96]

A =[1,2,3;4,5,6]
B= [1,2,3;4,5,6;7,8,9]
C=A*B
%%
%.* 点乘，元素按位相乘，矩阵大小必须一致
A = [1,2;3,4]
B = [2,3;4,5]
C =A .* B

%% / 右除
%对于标量的运算 a、b是两个标量，表示a**除**b，
%对于矩阵的运算，a、b是两个矩阵，a/b 表示矩阵a**乘**矩阵b的逆矩阵，与  a*inv(b)  一致。
A = [1,2;3,4]
B = [2,3;4,5]
A/B
%% ./ 点右除，矩阵元素按位右除，标量与普通右除一致
A = [1,2;3,4]
B = [2,3;4,5]
A./B
 %%   \左除，对于标量，C = A\B可以简单理解为B/A，
 %对于矩阵可以理解为矩阵a的逆矩阵**乘**矩阵B，与  inv(A)*B  一致
 A = [1,2;3,4]
B = [2,3;4,5]
A\B
%% .\左点除，矩阵元素按位左除，标量与普通一致
 A = [1,2;3,4]
B = [2,3;4,5]
A.\B
 %% ^ 幂运算，,矩阵与标量都进行幂运算
 A = ones(2)
 A^2
 B = 2
 B^2
 %% .^点幂运算，矩阵按位幂运算
A = ones(2)
 A.^2
 B = 2
 B.^2
 %% ' 转置矩阵，简单理解为行列互换
 A=[1,2;3,4]
 A'
 %%

%  % 关系运算符
%  关系运算符也可以用于标量和非标量数据。数组的关系运算符在两个数组之间执行逐个元素的比较，并返回相同大小的逻辑数组，
%如果为真，则元素设置为逻辑`1(true)`，如果为假，则元素设置为逻辑`0(false)`。
% `<`小于
% `<=`小于等于
% `>`大于
% `>=`大于等于
% `==`等于
% `~=`不等于
1<5
1<=5
A=[1,2]
A<5
5>1
5>=1
A=[1,2]
A>5
1==1
1==2
1~=1
1~=2
%% 
% 逻辑运算符
% `&`与运算
% 
% `|`或运算
% 
% `~`非运算
A = [1,1,0,1]
B =[1,1,1,0]
 A&B
 ~A
 A|B